testes/cash-machine/DASI/bus_api/app/controllers/networks_controller.rb

  def index
    @networks = Network.all
---
SELECT `networks`.* FROM `networks`