testes/cash-machine/DASI/bus_api/app/controllers/sessions_controller.rb

UPDATE `users` SET `sign_in_count` = 3, `current_sign_in_at` = '2018-06-08 01:22:41', `last_sign_in_at` = '2018-06-02 17:51:58', `current_sign_in_ip` = '172.18.0.1', `last_sign_in_ip` = '172.19.0.1' WHERE `users`.`id` = 1
---
  def create
    key = (resource_params.keys.map(&:to_sym) & resource_class.authentication_keys).first
    if key
      # find user by params key [:email, :username], when email is present. It is taken as default
      user = User.find_by(key => resource_params[key])
      # create client id & token
      token = SecureRandom.urlsafe_base64(nil, false)
      client_id = SecureRandom.urlsafe_base64(nil, false)
      if user && user.valid_password?(resource_params[:password])
        user.tokens[client_id] = {
          token: BCrypt::Password.create(token),
          expiry: (Time.now + DeviseTokenAuth.token_lifespan).to_i
        }
        user.skip_email_validation = true
        user.skip_username_validation = true
        user.skip_password_validation = true
        user.skip_password_confirmation_validation = true
        user.skip_uid_validation = true
        user.save