testes/cash-machine/DASI/bus_api/app/controllers/shippings_controller.rb

SELECT `shippings`.* FROM `shippings` WHERE `shippings`.`entity_id` IS NULL
---
  def index
    shippings = Shipping.where(entity_id: current_user.entity_id)